import electricImg from "./assets/eleqtro.webp";
import minecraft from "./assets/mainkrafti-qartulad.webp";

const FilmsData = [
  {
    title: "The Electric State",
    rating: 10,
    img: electricImg,
    year: 2025,
    desc: "ფილმი მოგვითხრობს ობოლი მოზარდის შესახებ, რომელიც იდუმალ რობოტთან ერთად - გზას ადგება თავისი დიდი ხნის დაკარგული ძმის მოსაძებნად",
    isFavourite: false,
    id:0
  },

  {
    title: "A Minecraft Movie",
    rating: 10,
    img: minecraft,
    year: 2025,
    desc: "ოთხი ადამიანი მოულოდნელად იდუმალი პორტალიდან უცნაურ სამყაროში ხვდება. სახლში დასაბრუნებლად მოუწევთ დაეუფლონ ამ სამყაროს, როდესაც დაიწყებენ ქვესტს პროფესიონალ კრაფტერთან ერთად.",
    isFavourite: false,
    id:1
  },
  {
    title: "A Working Man",
    rating: 10,
    img: "https://adjaranets.to/uploads/posts/2025-04/profesionali.webp",
    year: 2025,
    desc: "ლევონ კეიდმა დატოვა თავისი საიდუმლო სამასახურის აგენტის პროფესია, რათა გამხდარიყო მუშა და ემუშავა მშენებლობაზე. მას სურს იცხოვროს უბრალო ცხოვრებით და იყოს კარგი მამა. მაგრამ როდესაც მისი უფროსის თინეიჯერი ქალიშვილი - ჯენი დაიკარგება, მან უნდა გამოიყენოს ის უნარები, რამაც იგი ლეგენდარულ ფიგურად აქცია საიდუმლო ოპერაციების ბნელ სამყაროში. მის ნადირობას დაკარგულ კოლეჯის სტუდენტზე მთავარი გმირი მიჰყავს ბოროტი დანაშაულებრივი შეთქმულების წიაღში, რაც ქმნის ჯაჭვურ რეაქციას, რომელიც საფრთხეს შეუქმნის მის ახალ ცხოვრებას....",
    isFavourite: false,
    id:2
  },

  {
    title: "Old Guy",
    rating: 10,
    img: "https://adjaranets.to/uploads/posts/2025-04/qileri-babu-qartulad.webp",
    year: 2024,
    desc: "პენსიაზე გასული დაქირავებული მკვლელი ტერი იუბანკსი, რომელიც კვლავ თვლის თავს საუკეთესოდ თავის საქმეში, სიხარულით უბრუნდება პროფესიას, რათა მოამზადოს რთული ხასიათის მქონე – ახალგაზრდა ახალბედა ვუნდერკინდი მკვლელი ვილბორგი. შედეგად, მათ სთხოვენ, გაანადგურონ კონკურენტი კრიმინალური სინდიკატის საუკეთესო წევრები და ამ პროცესში გმირები გამოავლენენ დამსაქმებლის ნამდვილ მოტივებს: ძველი გვარდიის ლიკვიდაცია და სინდიკატის ხელში ჩაგდება. თუმცა, ორგანიზაცია არ ელოდა, რომ ტერის გამოცდილება და ვილბორგის გონებრივი შესაძლებლობები, შექმნიდა მათ შორის ასეთ წარმოუდგენელ კავშირს...",
    isFavourite: false,
    id:3
  },

  {
    title: "Mahkum",
    rating: 10,
    img: "https://adjaranets.to/uploads/posts/2022-10/patimari.jpg",
    year: 2021,
    desc: "წარმატებულ პროკურორ ფირატს, რომელსაც არაფერი ახსოვს, ცოლ-შვილის მკვლელობაში ედება ბრალი. სიმართლის გამოსავლენად ციხიდან უნდა გაიქცეს",
    isFavourite: false,
    id:4
  },

  {
    title: "Panda Plan",
    rating: 10,
    img: "https://adjaranets.to/uploads/posts/2024-10/pandas-gegma-qartulad.webp",
    year: 2024,
    desc: "პანდას გეგმა მოგვითხრობს ჯეკი ჩანზე, რომელსაც პანდას გადარჩენაში უწევს მონაწილეობა, მას შემდეგ, რაც საერთაშორისო კრიმინალური სინდიკატი ცდილობს საყვარელი პანდის გატაცებას. ის თავის აგენტთან და პანდას მომვლელთან ერთად სახიფათო, მაგრამ სასაცილო თავგადასავალში ერთვება, რათა გადაურჩეს სინდიკატის მახეებს",
    isFavourite: false,
    id:5
  },

  {
    title: "Escape Plan 2: Hades",
    rating: 10,
    img: "https://adjaranets.to/uploads/posts/2024-07/medium/wzksowyvppq3r7s7b4b7ubyzoux.jpg",
    year: 2018,
    desc: "**„გაქცევის გეგმა 2: ჰადესი“ (Escape Plan 2: Hades, 2018)** არის მძაფრსიუჟეტიანი თრილერი, რომელიც გრძელდება რეი ბრესლინის ისტორიით, რომელმაც გაითქვა სახელი სუპერგამძლე ციხეებიდან გაქცევის უნარით. ამჯერად, რეის მოუწევს ახალი გამოწვევის წინაშე დადგომა, როდესაც მისი მეგობარი და გუნდის წევრი, შუ, გაუჩინარდება. შუს აიყვანენ და მოათავსებენ ახალ, ტექნოლოგიურად განვითარებულ და მაღალდაცვის მქონე ციხეში სახელად „ჰადესი ფილმი სავსეა დინამიკური ბრძოლებით, ინტენსიური გაქცევის სცენებით და მაღალტექნოლოგიური უსაფრთხოების სისტემებით, რაც რეის წინაშე თითქმის დაუძლეველ გამოწვევას ქმნის. „გაქცევის გეგმა 2“ აერთიანებს ფიზიკურ უნარებს, გუნდურ მუშაობას და რთულ სტრატეგიულ გეგმებს, რათა გმირებმა გადალახონ მომაკვდინებელი დაბრკოლებები და ჰადესიდან თავი დააღწიონ",
    isFavourite: false,
    id:6
  },

  {
    title: "The Warlords",
    rating: 10,
    img: "https://adjaranets.to/uploads/posts/2019-11/1572704747_7xzgbsulc562zh1qua2wwcnoc1a.jpg",
    year: 2007,
    desc: "ფილმი “The Warlords” მოგვითხრობს ჩინეთის მე-19 საუკუნის შიდა ომის დროს განვითარებულ დრამატულ მოვლენებზე. მთავარი გმირი, გენერალი პანგ კინგიუნი, რომელიც ბრძოლაში ყველა თანამებრძოლს კარგავს, შემთხვევით გადარჩენილს ხვდება უბრალო ყაჩაღთა ჯგუფს, რომელსაც ორი მეგობარი, ჟაო ერმუ და ჟანგ ვენსიანი, ხელმძღვანელობენ. მათ შორის მტკიცე ძმობა ყალიბდება, და ისინი ერთიანდებიან, რათა ბრძოლაში ჩაერთონ როგორც ახალი სამხედრო ლიდერები.ფილმის სიუჟეტი აღწერს ძმობის, ერთგულების და ღალატის მძიმე თემებს. პანგი, რომელიც მართავს არმიას და სამხედრო ძალით ცდილობს ჩინეთში წესრიგის დამყარებას, თანდათან აღმოჩნდება რთულ მორალურ დილემებში. მას ერთგულება აქვს sworn-ად მეგობრებთან, თუმცა თანავე იძულებულია, სასტიკი გადაწყვეტილებები მიიღოს, რაც თანდათან მათი ურთიერთობების გართულებას იწვევს.ფილმი სავსეა ეპიკური ბრძოლებით და ემოციური სცენებით, სადაც ასახულია გმირების პირადი ბრძოლები და მსხვერპლი, რასაც ისინი ღალატის, ღირსების და სიყვარულისთვის იხდიან. “The Warlords” შთამბეჭდავად აჩვენებს ჩინეთის ისტორიულ კონტექსტს და ადამიანთა შინაგან კონფლიქტებს, სადაც ომი და მეგობრობა ერთმანეთს უპირისპირდება.",
    isFavourite: false,
    id:7
  },

  {
    title: "Best of the Best 4: Without Warning",
    rating: 10,
    img: "https://adjaranets.to/uploads/posts/2019-11/1574598508_mwkdm2xjjkwz5rzihwji4sdhgp0.jpg",
    year: 1998,
    desc: "ფილმი “Best of the Best 4: Without Warning” მოგვითხრობს ყოფილი საბრძოლო ხელოვნების ოსტატის, ტომი ლის ისტორიას, რომელიც შემთხვევით აღმოჩნდება ფულების გაყალბების და დანაშაულებრივი სქემების ცენტრში. ტომი, რომელიც მშვიდ ცხოვრებას ეძებს, მოულოდნელად ხვდება საერთაშორისო კრიმინალური ორგანიზაციის გზაზე, როდესაც ფალსიფიცირებული ფულის დისკის მოპარვის მოწმე ხდებამთავარი გმირი, ტომი, ცდილობს არ ჩაერიოს ამ კრიმინალურ ქმედებებში, თუმცა იძულებულია, ჩაერთოს ბრძოლაში, როცა მისი ოჯახი და მეგობრები საფრთხეში აღმოჩნდებიან. ის ცდილობს, ერთის მხრივ, გაუმკლავდეს ორგანიზაციას, რომელიც ეძებს დისკს, ხოლო მეორეს მხრივ, პოლიციას, რომელიც მასზე ნადირობს. ფილმის მოქმედება სავსეა დინამიკური და სანახაობრივი ბრძოლებით, სადაც ტომი საკუთარ ცოდნას და უნარებს იყენებს, რათა გადარჩეს და გაათავისუფლოს თავისი საყვარელი ადამიანები.ფილმი ხაზს უსვამს ტომი ლის ძლიერ მორალურ პრინციპებსა და დაუღალავ ბრძოლას სამართლიანობისთვის, რაც კიდევ ერთხელ აჩვენებს მის როგორც მებრძოლის, ასევე ადამიანის ღირებულებებს.",
    isFavourite: false,
    id:8
  },


  {
    title: "The Legend of Bruce Lee: Part 16.4",
    rating: 10,
    img: "https://adjaranets.to/uploads/posts/2019-12/1577630120_the-legend-of-bruce-lee-part-1.jpg",
    year: 2010,
    desc: "უნიკალური ფილმი-ბიოგრაფია საბრძოლო ხელოვნების დიდი ოსტატის ბრიუს ლის შესახებ, დაწყებული მისი ბავშვობიდან და დამთავრებული ტრაგიკულ სიკვდლამდე. ჩინელმა კინომატოგრაფებმა გსაოცარი სიზუსტით შექმნეს ყველა ინტერიერი და მდგომარეობა ბრიუს ლის ფილმის გადასაღებად, ასევე მოგვითხრობენ მისი ოჯახის შესახებ, ცხოვრების რთულად განვლილ გზას: პრესტიჟული კოლეჯის მოსწავლიდან, მსოფლიოს კინო-ვარსკვლავამდე! ფილმი გადაღებულია ბრიუს ლის ქალიშვილის - შენონ ლის მიერ",
    isFavourite: false,
    id:9
  },



  {
    title: "Jumong",
    rating: 10,
    img: "https://adjaranets.to/uploads/posts/2020-04/1588272040_1479986416_jumong.jpg",
    year: 2006,
    desc: "სერიალში წარმოდგენილი გრანდიოზული ეპიკური ლეგენდა ჟუმონგზე, უძველესი კორეის კოგურიოს დიდი სამეფოს (37 წ. ჩვ.ერამდე. – 668 წ. ჩვ. წთ. აღ-ით) დამაარსებელზე მოგვითხრობს, დაწყებული მისი დაბადების დღიდან, დამთავრებელი - მისი ტახტზე ასვლით. ერთ დროს ძლიერი ქვეყანა, შინა ომების გამო, ახლა ნანგრევებად ქცეულა. არ ჩანს ნამდვილი გმირი, რომელიც მის გაერთიანებას შეძლებს და წარსულის ძლევამოსილებას დაუბრუნებს ქვეყანას. ამ მისიის შესრულება ჟუმონგს მოუწევს, რომელმაც დაქსაქსული თანამემამულეების გასაერთიანებლად მრავალი სირთულეები გადაიტანა: დაწყებული სასახლის კარის მოღალატური ინტრიგებით, დამთავრებული - ერთგული თანამოაზრეების ძალისხმევითა და თანადგომით. თავდაპირველად, დაგეგმილი იყო 60 სერიის გადაღება, მაგრამ მაყურებელთა მოთხოვნით 81 სერია გადაიღეს. სერიალი დიდი პოპულარობით სარგებლობს მსოფლიოს მრავალ ქვეყანაში",
    isFavourite: false,
    id:10
  },

  
];


export default FilmsData
// 